Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32100E-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                            |I2C1|I2C2|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|ADC1 |TIM (PWM)                        |RCC       |SYS           
PA0 , // |USART2_CTS [ST3232_R2OUT]              |    |    |     |     |     |      |      |      |*IN0 |*TIM5_CH1 *TIM2_CH1              |          |              
PA1 , // |USART2_RTS [ST3232_T2IN]               |    |    |     |     |     |      |      |      |*IN1 |*TIM5_CH2 *TIM2_CH2              |          |              
PA2 , // |USART2_TX [ST3232_T1IN]                |    |    |     |     |     |      |*TX   |      |*IN2 |*TIM5_CH3 *TIM2_CH3 *TIM15_CH1   |          |              
PA3 , // |USART2_RX [ST3232_R1OUT]               |    |    |     |     |     |      |*RX   |      |*IN3 |*TIM15_CH2 *TIM5_CH4 *TIM2_CH4   |          |              
PA4 , // |DAC1_Audio [TS4956_LIN]                |    |    |     |     |     |      |      |      |*IN4 |                                 |          |              
PA5 , // |Flash_SCK [M25P128_C]                  |    |    |*SCK |     |     |      |      |      |*IN5 |                                 |          |              
PA6 , // |Flash_MISO [M25P128_Q]                 |    |    |*MISO|     |     |      |      |      |*IN6 |*TIM3_CH1 +TIM16_CH1             |          |              
PA7 , // |Flash_MOSI [M25P128_D]                 |    |    |*MOSI|     |     |      |      |      |*IN7 |+TIM1_CH1N *TIM3_CH2 +TIM17_CH1  |          |              
PA8 , // |                                       |    |    |     |     |     |      |      |      |     |*TIM1_CH1                        |          |              
PA9 , // |USART1_TX [ST3241_T2IN]                |    |    |     |     |     |*TX   |      |      |     |*TIM1_CH2                        |          |              
PA10, // |USART1_RX [ST3241_R3OUT]               |    |    |     |     |     |*RX   |      |      |     |*TIM1_CH3                        |          |              
PA11, // |IrDA_SD [TFDU6300_SD]                  |    |    |     |     |     |      |      |      |     |*TIM1_CH4                        |          |              
PA12, // |IO_Expandor_INT [STMPE811_INT]         |    |    |     |     |     |      |      |      |     |                                 |          |              
PA13, // |TMS/SWDIO                              |    |    |     |     |     |      |      |      |     |                                 |          |*JTMS-SWDIO   
PA14, // |TCK/SWCLK                              |    |    |     |     |     |      |      |      |     |                                 |          |*JTCK-SWCLK   
PA15, // |TDI                                    |    |    |     |     |     |      |      |      |     |+TIM2_CH1                        |          |*JTDI         
PB0 , // |                                       |    |    |     |     |     |      |      |      |*IN8 |*TIM3_CH3 +TIM13_CH1 +TIM1_CH2N  |          |              
PB1 , // |                                       |    |    |     |     |     |      |      |      |*IN9 |*TIM3_CH4 +TIM1_CH3N +TIM14_CH1  |          |              
PB2 , // |                                       |    |    |     |     |     |      |      |      |     |                                 |          |              
PB3 , // |TDO/SWO                                |    |    |+SCK |     |*SCK |      |      |      |     |+TIM2_CH2                        |          |*JTDO-TRACESWO
PB4 , // |TRST                                   |    |    |+MISO|     |*MISO|      |      |      |     |+TIM3_CH1                        |          |*NJTRST       
PB5 , // |                                       |    |    |+MOSI|     |*MOSI|      |      |      |     |+TIM3_CH2                        |          |              
PB6 , // |I2C1_SCK [HDMI2C1-5DIJ_SLC_IC]         |*SCL|    |     |     |     |+TX   |      |      |     |*TIM16_CH1N *TIM4_CH1            |          |              
PB7 , // |I2C1_SDA [HDMI2C1-5DIJ_SDA_IC]         |*SDA|    |     |     |     |+RX   |      |      |     |*TIM17_CH1N *TIM4_CH2            |          |              
PB8 , // |HDMI_CEC [HDMI2C1-5DIJ_CEC_IC]         |+SCL|    |     |     |     |      |      |      |     |*TIM4_CH3 *TIM16_CH1             |          |              
PB9 , // |HDMI_HPD [HDMI2C1-5DIJ_HPD_IC]         |+SDA|    |     |     |     |      |      |      |     |*TIM17_CH1 *TIM4_CH4             |          |              
PB10, // |I2C2_SCK                               |    |*SCL|     |     |     |      |      |*TX   |     |+TIM2_CH3                        |          |              
PB11, // |I2C2_SDA                               |    |*SDA|     |     |     |      |      |*RX   |     |+TIM2_CH4                        |          |              
PB12, // |TemperatureSensor_INT [STLM75_OS/INT]  |    |    |     |     |     |      |      |      |     |+TIM12_CH1                       |          |              
PB13, // |MicroSD_SCK                            |    |    |     |*SCK |     |      |      |      |     |*TIM1_CH1N +TIM12_CH2            |          |              
PB14, // |MicroSD_MISO                           |    |    |     |*MISO|     |      |      |      |     |*TIM1_CH2N +TIM15_CH1            |          |              
PB15, // |MicroSD_MOSI                           |    |    |     |*MOSI|     |      |      |      |     |+TIM15_CH2 *TIM1_CH3N *TIM15_CH1N|          |              
PC0 , // |                                       |    |    |     |     |     |      |      |      |*IN10|                                 |          |              
PC1 , // |                                       |    |    |     |     |     |      |      |      |*IN11|                                 |          |              
PC2 , // |                                       |    |    |     |     |     |      |      |      |*IN12|                                 |          |              
PC3 , // |                                       |    |    |     |     |     |      |      |      |*IN13|                                 |          |              
PC4 , // |Potentiometer [RV1]                    |    |    |     |     |     |      |      |      |*IN14|*TIM12_CH1                       |          |              
PC5 , // |                                       |    |    |     |     |     |      |      |      |*IN15|*TIM12_CH2                       |          |              
PC6 , // |IR_IN [TSOP34836]                      |    |    |     |     |     |      |      |      |     |+TIM3_CH1                        |          |              
PC7 , // |LCD_backlight [AM-240320D4T_BL_Control]|    |    |     |     |     |      |      |      |     |+TIM3_CH2                        |          |              
PC8 , // |                                       |    |    |     |     |     |      |      |      |     |+TIM3_CH3 *TIM13_CH1             |          |              
PC9 , // |RS485_DIR [ST485_DE]]                  |    |    |     |     |     |      |      |      |     |+TIM3_CH4 *TIM14_CH1             |          |              
PC10, // |IrDA_TX [TFDU6300_TxD]                 |    |    |     |     |     |      |      |+TX   |     |                                 |          |              
PC11, // |IrDA_RX [TFDU6300_RxD]                 |    |    |     |     |     |      |      |+RX   |     |                                 |          |              
PC12, // |USART5_TX [ST485_DI]]                  |    |    |     |     |     |      |      |      |     |                                 |          |              
PC13, // |Anti_Tamper [B3 Button]                |    |    |     |     |     |      |      |      |     |                                 |          |              
PC14, // |OSC32_IN                               |    |    |     |     |     |      |      |      |     |                                 |*OSC32_IN |              
PC15, // |OSC32_OUT                              |    |    |     |     |     |      |      |      |     |                                 |*OSC32_OUT|              
PD0 , // |D2                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PD1 , // |D3                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PD2 , // |USART5_RX [ST485_R0]                   |    |    |     |     |     |      |      |      |     |                                 |          |              
PD3 , // |FSMC_CLK                               |    |    |     |     |     |      |      |      |     |                                 |          |              
PD4 , // |FSMC_NOE [CY7C1071D_OE]                |    |    |     |     |     |      |      |      |     |                                 |          |              
PD5 , // |FSMC_NWE [CY7C1071D_WE]                |    |    |     |     |     |      |+TX   |      |     |                                 |          |              
PD6 , // |FSMC_NWAIT                             |    |    |     |     |     |      |+RX   |      |     |                                 |          |              
PD7 , // |FSMC_NE0                               |    |    |     |     |     |      |      |      |     |                                 |          |              
PD8 , // |D13                                    |    |    |     |     |     |      |      |+TX   |     |                                 |          |              
PD9 , // |D14                                    |    |    |     |     |     |      |      |+RX   |     |                                 |          |              
PD10, // |D15                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PD11, // |A16                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PD12, // |A17                                    |    |    |     |     |     |      |      |      |     |+TIM4_CH1                        |          |              
PD13, // |A18                                    |    |    |     |     |     |      |      |      |     |+TIM4_CH2                        |          |              
PD14, // |D0                                     |    |    |     |     |     |      |      |      |     |+TIM4_CH3                        |          |              
PD15, // |D1                                     |    |    |     |     |     |      |      |      |     |+TIM4_CH4                        |          |              
PE0 , // |FSMC_BLN0 [CY7C1071D_BLE]              |    |    |     |     |     |      |      |      |     |                                 |          |              
PE1 , // |FSMC_BLN1 [CY7C1071D_BHE]              |    |    |     |     |     |      |      |      |     |                                 |          |              
PE2 , // |                                       |    |    |     |     |     |      |      |      |     |                                 |          |*TRACECLK     
PE3 , // |A19                                    |    |    |     |     |     |      |      |      |     |                                 |          |*TRACED0      
PE4 , // |A20                                    |    |    |     |     |     |      |      |      |     |                                 |          |*TRACED1      
PE5 , // |                                       |    |    |     |     |     |      |      |      |     |                                 |          |*TRACED2      
PE6 , // |Flash_CS [M25P128_S]                   |    |    |     |     |     |      |      |      |     |                                 |          |*TRACED3      
PE7 , // |D4                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PE8 , // |D5                                     |    |    |     |     |     |      |      |      |     |+TIM1_CH1N                       |          |              
PE9 , // |D6                                     |    |    |     |     |     |      |      |      |     |+TIM1_CH1                        |          |              
PE10, // |D7                                     |    |    |     |     |     |      |      |      |     |+TIM1_CH2N                       |          |              
PE11, // |D8                                     |    |    |     |     |     |      |      |      |     |+TIM1_CH2                        |          |              
PE12, // |D9                                     |    |    |     |     |     |      |      |      |     |+TIM1_CH3N                       |          |              
PE13, // |D10                                    |    |    |     |     |     |      |      |      |     |+TIM1_CH3                        |          |              
PE14, // |D11                                    |    |    |     |     |     |      |      |      |     |+TIM1_CH4                        |          |              
PE15, // |D12                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PF0 , // |A0                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF1 , // |A1                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF2 , // |A2                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF3 , // |A3                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF4 , // |A4                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF5 , // |A5                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF6 , // |LED1 [LED1 Green Led]                  |    |    |     |     |     |      |      |      |     |                                 |          |              
PF7 , // |LED2 [LED2 Orange Led]                 |    |    |     |     |     |      |      |      |     |                                 |          |              
PF8 , // |LED3 [LED3 Red Led]                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PF9 , // |LED4 [LED4 Blue Led]                   |    |    |     |     |     |      |      |      |     |                                 |          |              
PF10, // |OneNAND_INT                            |    |    |     |     |     |      |      |      |     |                                 |          |              
PF11, // |SDcard_detect                          |    |    |     |     |     |      |      |      |     |                                 |          |              
PF12, // |A6                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF13, // |A7                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF14, // |A8                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PF15, // |A9                                     |    |    |     |     |     |      |      |      |     |                                 |          |              
PG0 , // |A10                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PG1 , // |A11                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PG2 , // |A12                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PG3 , // |A13                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PG4 , // |A14                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PG5 , // |A15                                    |    |    |     |     |     |      |      |      |     |                                 |          |              
PG6 , // |MicroSD_CS                             |    |    |     |     |     |      |      |      |     |                                 |          |              
PG7 , // |JOY_SEL [MT008-A_Selection]            |    |    |     |     |     |      |      |      |     |                                 |          |              
PG8 , // |User_Button [B4 Button]                |    |    |     |     |     |      |      |      |     |                                 |          |              
PG9 , // |                                       |    |    |     |     |     |      |      |      |     |                                 |          |              
PG10, // |FSMC_NE2 [CY7C1071D_CE]                |    |    |     |     |     |      |      |      |     |                                 |          |              
PG11, // |JOY_DOWN [MT008-A_DOWN]                |    |    |     |     |     |      |      |      |     |                                 |          |              
PG12, // |FSMC_NE3 [AM-240320D4T_CS]             |    |    |     |     |     |      |      |      |     |                                 |          |              
PG13, // |JOY_RIGHT [MT008-A_RIGHT]              |    |    |     |     |     |      |      |      |     |                                 |          |              
PG14, // |JOY_LEFT [MT008-A_LEFT]                |    |    |     |     |     |      |      |      |     |                                 |          |              
PG15, // |JOY_UP [MT008-A_UP]                    |    |    |     |     |     |      |      |      |     |                                 |          |              
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

