Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32100E-EVAL.c
remaps_t remaps {
    { I2C1  , SCL  , GPIOB, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_I2C1_DISABLE    },
    { I2C1  , SCL  , GPIOB, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_I2C1_ENABLE     },
    { I2C1  , SDA  , GPIOB, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_I2C1_DISABLE    },
    { I2C1  , SDA  , GPIOB, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_I2C1_ENABLE     },
    { I2C2  , SCL  , GPIOB, GPIO_PIN_10 , AF_NO_REMAP                        },
    { I2C2  , SDA  , GPIOB, GPIO_PIN_11 , AF_NO_REMAP                        },
    { SPI1  , MISO , GPIOB, GPIO_PIN_4  , AF__HAL_AFIO_REMAP_SPI1_ENABLE     },
    { SPI1  , MISO , GPIOA, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_SPI1_DISABLE    },
    { SPI1  , MOSI , GPIOB, GPIO_PIN_5  , AF__HAL_AFIO_REMAP_SPI1_ENABLE     },
    { SPI1  , MOSI , GPIOA, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_SPI1_DISABLE    },
    { SPI1  , SCK  , GPIOA, GPIO_PIN_5  , AF__HAL_AFIO_REMAP_SPI1_DISABLE    },
    { SPI1  , SCK  , GPIOB, GPIO_PIN_3  , AF__HAL_AFIO_REMAP_SPI1_ENABLE     },
    { SPI2  , MISO , GPIOB, GPIO_PIN_14 , AF_NO_REMAP                        },
    { SPI2  , MOSI , GPIOB, GPIO_PIN_15 , AF_NO_REMAP                        },
    { SPI2  , SCK  , GPIOB, GPIO_PIN_13 , AF_NO_REMAP                        },
    { SPI3  , MISO , GPIOB, GPIO_PIN_4  , AF_NO_REMAP                        },
    { SPI3  , MOSI , GPIOB, GPIO_PIN_5  , AF_NO_REMAP                        },
    { SPI3  , SCK  , GPIOB, GPIO_PIN_3  , AF_NO_REMAP                        },
    { TIM12 , CH1  , GPIOB, GPIO_PIN_12 , AF__HAL_AFIO_REMAP_TIM12_ENABLE    },
    { TIM12 , CH1  , GPIOC, GPIO_PIN_4  , AF__HAL_AFIO_REMAP_TIM12_DISABLE   },
    { TIM12 , CH2  , GPIOB, GPIO_PIN_13 , AF__HAL_AFIO_REMAP_TIM12_ENABLE    },
    { TIM12 , CH2  , GPIOC, GPIO_PIN_5  , AF__HAL_AFIO_REMAP_TIM12_DISABLE   },
    { TIM13 , CH1  , GPIOC, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_TIM13_DISABLE   },
    { TIM13 , CH1  , GPIOB, GPIO_PIN_0  , AF__HAL_AFIO_REMAP_TIM13_ENABLE    },
    { TIM14 , CH1  , GPIOC, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_TIM14_DISABLE   },
    { TIM14 , CH1  , GPIOB, GPIO_PIN_1  , AF__HAL_AFIO_REMAP_TIM14_ENABLE    },
    { TIM15 , CH1  , GPIOA, GPIO_PIN_2  , AF__HAL_AFIO_REMAP_TIM15_DISABLE   },
    { TIM15 , CH1  , GPIOB, GPIO_PIN_14 , AF__HAL_AFIO_REMAP_TIM15_ENABLE    },
    { TIM15 , CH1N , GPIOB, GPIO_PIN_15 , AF_NO_REMAP                        },
    { TIM15 , CH2  , GPIOA, GPIO_PIN_3  , AF__HAL_AFIO_REMAP_TIM15_DISABLE   },
    { TIM15 , CH2  , GPIOB, GPIO_PIN_15 , AF__HAL_AFIO_REMAP_TIM15_ENABLE    },
    { TIM16 , CH1  , GPIOB, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_TIM16_DISABLE   },
    { TIM16 , CH1  , GPIOA, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_TIM16_ENABLE    },
    { TIM16 , CH1N , GPIOB, GPIO_PIN_6  , AF_NO_REMAP                        },
    { TIM17 , CH1  , GPIOB, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_TIM17_DISABLE   },
    { TIM17 , CH1  , GPIOA, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_TIM17_ENABLE    },
    { TIM17 , CH1N , GPIOB, GPIO_PIN_7  , AF_NO_REMAP                        },
    { TIM1  , CH1  , GPIOA, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM1  , CH1  , GPIOE, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH1N , GPIOB, GPIO_PIN_13 , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM1  , CH1N , GPIOE, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH1N , GPIOA, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_TIM1_PARTIAL    },
    { TIM1  , CH2  , GPIOA, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM1  , CH2  , GPIOE, GPIO_PIN_11 , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH2N , GPIOB, GPIO_PIN_0  , AF__HAL_AFIO_REMAP_TIM1_PARTIAL    },
    { TIM1  , CH2N , GPIOE, GPIO_PIN_10 , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH2N , GPIOB, GPIO_PIN_14 , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM1  , CH3  , GPIOA, GPIO_PIN_10 , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM1  , CH3  , GPIOE, GPIO_PIN_13 , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH3N , GPIOB, GPIO_PIN_15 , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM1  , CH3N , GPIOB, GPIO_PIN_1  , AF__HAL_AFIO_REMAP_TIM1_PARTIAL    },
    { TIM1  , CH3N , GPIOE, GPIO_PIN_12 , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH4  , GPIOE, GPIO_PIN_14 , AF__HAL_AFIO_REMAP_TIM1_ENABLE     },
    { TIM1  , CH4  , GPIOA, GPIO_PIN_11 , AF__HAL_AFIO_REMAP_TIM1_DISABLE    },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_0  , AF__HAL_AFIO_REMAP_TIM2_DISABLE    },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_15 , AF__HAL_AFIO_REMAP_TIM2_PARTIAL_1  },
    { TIM2  , CH2  , GPIOA, GPIO_PIN_1  , AF__HAL_AFIO_REMAP_TIM2_DISABLE    },
    { TIM2  , CH2  , GPIOB, GPIO_PIN_3  , AF__HAL_AFIO_REMAP_TIM2_PARTIAL_1  },
    { TIM2  , CH3  , GPIOB, GPIO_PIN_10 , AF__HAL_AFIO_REMAP_TIM2_PARTIAL_2  },
    { TIM2  , CH3  , GPIOA, GPIO_PIN_2  , AF__HAL_AFIO_REMAP_TIM2_DISABLE    },
    { TIM2  , CH4  , GPIOB, GPIO_PIN_11 , AF__HAL_AFIO_REMAP_TIM2_PARTIAL_2  },
    { TIM2  , CH4  , GPIOA, GPIO_PIN_3  , AF__HAL_AFIO_REMAP_TIM2_DISABLE    },
    { TIM3  , CH1  , GPIOB, GPIO_PIN_4  , AF__HAL_AFIO_REMAP_TIM3_PARTIAL    },
    { TIM3  , CH1  , GPIOC, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_TIM3_ENABLE     },
    { TIM3  , CH1  , GPIOA, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_TIM3_DISABLE    },
    { TIM3  , CH2  , GPIOB, GPIO_PIN_5  , AF__HAL_AFIO_REMAP_TIM3_PARTIAL    },
    { TIM3  , CH2  , GPIOC, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_TIM3_ENABLE     },
    { TIM3  , CH2  , GPIOA, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_TIM3_DISABLE    },
    { TIM3  , CH3  , GPIOC, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_TIM3_ENABLE     },
    { TIM3  , CH3  , GPIOB, GPIO_PIN_0  , AF__HAL_AFIO_REMAP_TIM3_DISABLE    },
    { TIM3  , CH4  , GPIOC, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_TIM3_ENABLE     },
    { TIM3  , CH4  , GPIOB, GPIO_PIN_1  , AF__HAL_AFIO_REMAP_TIM3_DISABLE    },
    { TIM4  , CH1  , GPIOD, GPIO_PIN_12 , AF__HAL_AFIO_REMAP_TIM4_ENABLE     },
    { TIM4  , CH1  , GPIOB, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_TIM4_DISABLE    },
    { TIM4  , CH2  , GPIOD, GPIO_PIN_13 , AF__HAL_AFIO_REMAP_TIM4_ENABLE     },
    { TIM4  , CH2  , GPIOB, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_TIM4_DISABLE    },
    { TIM4  , CH3  , GPIOB, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_TIM4_DISABLE    },
    { TIM4  , CH3  , GPIOD, GPIO_PIN_14 , AF__HAL_AFIO_REMAP_TIM4_ENABLE     },
    { TIM4  , CH4  , GPIOB, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_TIM4_DISABLE    },
    { TIM4  , CH4  , GPIOD, GPIO_PIN_15 , AF__HAL_AFIO_REMAP_TIM4_ENABLE     },
    { TIM5  , CH1  , GPIOA, GPIO_PIN_0  , AF_NO_REMAP                        },
    { TIM5  , CH2  , GPIOA, GPIO_PIN_1  , AF_NO_REMAP                        },
    { TIM5  , CH3  , GPIOA, GPIO_PIN_2  , AF_NO_REMAP                        },
    { TIM5  , CH4  , GPIOA, GPIO_PIN_3  , AF_NO_REMAP                        },
    { USART1, RX   , GPIOA, GPIO_PIN_10 , AF__HAL_AFIO_REMAP_USART1_DISABLE  },
    { USART1, RX   , GPIOB, GPIO_PIN_7  , AF__HAL_AFIO_REMAP_USART1_ENABLE   },
    { USART1, TX   , GPIOA, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_USART1_DISABLE  },
    { USART1, TX   , GPIOB, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_USART1_ENABLE   },
    { USART2, RX   , GPIOD, GPIO_PIN_6  , AF__HAL_AFIO_REMAP_USART2_ENABLE   },
    { USART2, RX   , GPIOA, GPIO_PIN_3  , AF__HAL_AFIO_REMAP_USART2_DISABLE  },
    { USART2, TX   , GPIOA, GPIO_PIN_2  , AF__HAL_AFIO_REMAP_USART2_DISABLE  },
    { USART2, TX   , GPIOD, GPIO_PIN_5  , AF__HAL_AFIO_REMAP_USART2_ENABLE   },
    { USART3, RX   , GPIOB, GPIO_PIN_11 , AF__HAL_AFIO_REMAP_USART3_DISABLE  },
    { USART3, RX   , GPIOC, GPIO_PIN_11 , AF__HAL_AFIO_REMAP_USART3_PARTIAL  },
    { USART3, RX   , GPIOD, GPIO_PIN_9  , AF__HAL_AFIO_REMAP_USART3_ENABLE   },
    { USART3, TX   , GPIOB, GPIO_PIN_10 , AF__HAL_AFIO_REMAP_USART3_DISABLE  },
    { USART3, TX   , GPIOC, GPIO_PIN_10 , AF__HAL_AFIO_REMAP_USART3_PARTIAL  },
    { USART3, TX   , GPIOD, GPIO_PIN_8  , AF__HAL_AFIO_REMAP_USART3_ENABLE   },
};
